update the arch diagram
